In [200]:
import pandas as pd
import numpy as np

In [201]:
names_df = pd.read_csv("raw_data/Names.csv",usecols = [0,1])
address_df = pd.read_csv("raw_data/address.csv").sample(100, random_state = 2022, ignore_index = True)
cardno_df = pd.read_csv("raw_data/cardno.csv",usecols = [0]).sample(100, random_state = 2022, ignore_index = True)
cardno_df

            Card_Number
0   2357-9896-6403-5970
1   6514-4444-5642-2615
2   4783-2852-8264-4966
3   4856-2191-9879-6388
4   4138-5166-7490-1188
..                  ...
95  7837-4036-5999-1672
96  3652-5528-4808-8216
97  7658-7645-4568-1461
98  4093-1634-8086-4601
99  8231-5519-1948-3400

[100 rows x 1 columns]

### Customers data

**Names attribute**

In [202]:
customer_df = names_df.iloc[:100,:].copy()
customer_df.rename(columns = {'First Name': "fname", "Last Name": "lname"}, inplace = True)
customer_df

        fname     lname
0    Mechelle  Stoneman
1      Tyesha   Freitag
2        Dean  Stoecker
3     Annelle   Pickney
4   Margareta      Tacy
..        ...       ...
95     Glenda  Woolfolk
96     Alyson    Hosack
97    Francis     Sines
98      Riley   Bagnall
99    Carmina      Camp

[100 rows x 2 columns]

**id, age, email, address**

In [203]:
np.random.seed(2022)
email_suffix = ['@yahoo.com', '@gmail.com', '@hotmail.com', '@nyu.edu']
email_suffix_list = np.random.choice(email_suffix,100)

age = np.random.randint(18, 60, 100)
# print(age)

cid = np.random.randint(111111, 999999, 100)
# print(cid)

email_list = [f.lower()+l.lower()+e for f,l,e in zip(customer_df['fname'], customer_df['lname'], email_suffix_list)]
# print(email_list)

address_list = [', '.join(val) for val in address_df.astype(str).values.tolist()]
# print(address_list)


customer_df['customer_id'] = cid
customer_df['age'] = age
customer_df['email'] = email_list
customer_df['address'] = address_list

In [215]:
customer_df = customer_df[['customer_id', 'fname', 'lname', 'age', 'email', 'address']]

In [216]:
customer_df.to_csv('final_data/Customers.csv', index = False)

## Cards data

In [213]:
np.random.seed(2022)
customer_sample = customer_df.sample(100, replace = True, random_state = 2022)

expiry_month = np.random.randint(1,13, 100)
# print(expiry_month)

expiry_year = np.random.randint(2024,2030, 100)
# print(expiry_year)


cards_df = pd.DataFrame()
cards_df['card_number'] = [''.join(val.strip().split('-')) for val in cardno_df['Card_Number']]
cards_df['customer_id'] = list(customer_sample['customer_id'])
cards_df['billing_address'] = list(customer_sample['address'])
cards_df['expiry_month'] = expiry_month
cards_df['expiry_year'] = expiry_year

In [214]:
cards_df.to_csv('final_data/HasCards.csv', index = False)